ZalophusDokdo/LED_Matrix_Bar_Weather_Station/ESP8266/ESP8266_LED_Matrix_Bar_Weather_Station/Web_Server.h
/* =========================================================================
 *  Author: Zalophus Dokdo (https://zddh.blogspot.com)
 *  Date: 31/08/2017       (https://zalophus.tistory.com/)
 *  License: GPL v2
 * =========================================================================
 *  LED Matrix Bar Weather Station V1.0.4b (Publish: 2018/01/02)
 * =========================================================================
 *  Web Server
 * =========================================================================
 */

#ifndef WEB_SERVER_H
#define WEB_SERVER_H

#include <ESP8266WebServer.h>

// Set the port you wish to use, a browser default is 80, but any port can be used, if you set it to 5555 then connect with http://nn.nn.nn.nn:5555/
ESP8266WebServer server(80);

String webTitle                = WEB_TITLE;
String webSubTitle             = WEB_SUBTITLE;
String iconLink                = ICON_LINK;
String faviconLink             = FAVICON_LINK;
int    webPageRefresh          = WEB_PAGE_REFRESH;
String webInternalTempTitle    = WEB_INTERNALTEMPTITLE;

int    OTAmode                 = OTA_MODE;
int    Clock                   = CLOCK;
int    dateScroll              = DATE_SCROLL;
int    weatherScroll           = WEATHER_SCROLL;
int    indoor                  = INDOOR;
int    outdoor                 = OUTDOOR;
int    indoorScroll            = INDOOR_SCROLL;
int    outdoorScroll           = OUTDOOR_SCROLL;
int    waitScroll              = WAIT_SCROLL;

extern "C" {
  uint16 readvdd33(void);
}

String deg                     = String(char('~'+25));
String webpage                 = "";
String printMsg;

int    onTimeAlarm             = 0;
int    alarm_state             = ALARM_STATE;
int    alarm_h_set             = ALARM_H_SET;
int    alarm_m_set             = ALARM_M_SET;
String alarm_ampm_select       = "AM";

int    timer_state             = TIMER_STATE;
int    timer_h_start           = TIMER_H_START;
int    timer_m_start           = TIMER_M_START;
int    timer_h_stop            = TIMER_H_STOP;
int    timer_m_stop            = TIMER_M_STOP;
String timer_start_ampm_select = "AM";
String timer_stop_ampm_select  = "AM";

int    button16count           = 0;
int    button00count           = 0;
int    button12count           = 0;
#if defined(DEV_BOARD_Witty) || defined(DEV_BOARD_WiFi_RELAY_MODULE)
  int  light05on_state         = 0;
#endif

void append_webpage_header() {
  // webpage is a global variable
  webpage = ""; // A blank string variable to hold the web page
  webpage += "<!DOCTYPE HTML>";
  webpage += "<html>";
  webpage += "<head>";
  webpage += "  <meta http-equiv='refresh' content='" + String(webPageRefresh) + "; url=./' />";
  webpage += "  <meta name='apple-mobile-web-app-capable' content='yes' />";
  webpage += "  <meta name='apple-mobile-web-app-status-bar-style' content='black-translucent' />";
  webpage += "  <meta name='viewport' content='width=device-width, initial-scale=1.0'>";
  webpage += "  <link rel='apple-touch-icon' href='" + iconLink + "' />";
  webpage += "  <link rel='shortcut icon' href='" + faviconLink + "' />";
  webpage += "  <title>" + webTitle + " - Zalophus's DesignHouse</title>";
  webpage += "  <style>";
  webpage += "    #jb-container { width: 940px; margin: 0px auto; padding: 10px; border: 1px solid #bcbcbc; }";
  webpage += "    #jb-header { padding: 0px; margin-bottom: 10px; border: 1px solid #bcbcbc; }";
  webpage += "    #jb-content   { width: 580px; padding: 10px; margin-bottom: 10px; float: left; border: 1px solid #bcbcbc;";
  webpage += "                    background-image: url(https://raw.githubusercontent.com/ZalophusDokdo/LED_Matrix_Bar_Weather_Station/master/images/weather_2_2682849_512.png);";
  webpage += "                    background-repeat: no-repeat; background-attachment: fixed; background-size: 100%;";
  webpage += "                  }";
  webpage += "    #jb-sidebar { width: 310px; padding: 10px; margin-bottom: 10px; float: right; border: 1px solid #bcbcbc; }";
  webpage += "    #jb-footer { clear: both; padding: 10px; border: 1px solid #bcbcbc; }";
  webpage += "    @media screen and (max-width:480px) {";
  webpage += "      #jb-container { width: auto; }";
  webpage += "      #jb-content { float: none; width: auto; }";
  webpage += "      #jb-sidebar { float: none; width: auto; }";
  webpage += "    }";
  //* Button style */
  webpage += "    button::-moz-focus-inner,";
  webpage += "    input::-moz-focus-inner { border: 0; padding: 0; }";
  webpage += "    .ct-btn { display: inline-block; margin: 5px 0; padding: .5em .75em; border-radius: .25em; box-sizing: content-box; -moz-box-sizing: content-box; background: transparent; outline: 0; vertical-align: middle; font-family: inherit; font-size: 18px; text-decoration: none; white-space: nowrap; cursor: pointer }";
  webpage += "    .en-01 { font-family: 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: 14px; font-weight: bold; }";
  //* Red, Green, Blue, Yellow */
  webpage += "    .ct-btn.red,";
  webpage += "    .ct-btn.red:link,";
  webpage += "    .ct-btn.red:visited { color: #fff; text-shadow: 0 1px 0 #991e1a; border: 1px solid #991e1a; border-top: 1px solid #c06f01; box-shadow: 0px 2px 2px 0px rgba(0, 0, 0, 0.20); background: #b22520; background: linear-gradient(to bottom, #e8605a 0%, #b22520 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#e8605a', endColorstr='#b22520', GradientType=0 ); }";
  webpage += "    .ct-btn.red:hover { background: #ca3631; background: linear-gradient(to bottom, #f17771 0%, #ca3631 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#ffdc78', endColorstr='ffb618', GradientType=0 ); }";
  webpage += "    .ct-btn.red:active,";
  webpage += "    .ct-btn.red.active { border-color: #a0211d; border-top-color: #7f1b17; background: #b22520; box-shadow: none; text-shadow: none; }";
  webpage += "    .ct-btn.green,";
  webpage += "    .ct-btn.green:link,";
  webpage += "    .ct-btn.green:visited { color: #fff; text-shadow: 0 1px 0px #135fa4; border: 1px solid #368321; border-top-color: #439f2a; box-shadow: 0px 2px 2px 0px rgba(0, 0, 0, 0.22); background: #76ac41; background: linear-gradient(to bottom, #76ac41 0%, #489215 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#76ac41', endColorstr='#489215', GradientType=0 ); }";
  webpage += "    .ct-btn.green:hover { background: #4c9b16; background: linear-gradient(to bottom, #7ab243 0%, #4c9b16 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#7ab243', endColorstr='#4c9b16', GradientType=0 ); }";
  webpage += "    .ct-btn.green:active,";
  webpage += "    .ct-btn.green.active { border-color: #6c9d3c; border-top-color: #368321; background: #4c9b16; box-shadow: none; text-shadow: none; }";
  webpage += "    .ct-btn.blue,";
  webpage += "    .ct-btn.blue:link,";
  webpage += "    .ct-btn.blue:visited { color: #fff; text-shadow: 0 1px 0px #135fa4; border: 1px solid #135fa4; border-top-color: #2d9acf; box-shadow: 0px 2px 2px 0px rgba(0, 0, 0, 0.22); background: #3aaee7; background: linear-gradient(to bottom, #3aaee7 0%, #1a80d9 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#3aaee7', endColorstr='#1a80d9', GradientType=0 ); }";
  webpage += "    .ct-btn.blue:hover { background: #50bae9; background: linear-gradient(to bottom, #50bae9 0%, #3392de 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#50bae9', endColorstr='#3392de', GradientType=0 ); }";
  webpage += "    .ct-btn.blue:active,";
  webpage += "    .ct-btn.blue.active { border-color: #2585d9; border-top-color: #0f4678; background: #2d90e7; box-shadow: none }";
  webpage += "    .ct-btn.yellow,";
  webpage += "    .ct-btn.yellow:link,";
  webpage += "    .ct-btn.yellow:visited { color: #000; text-shadow: 0 1px 0 #fcda7c; border: 1px solid #dfac23; border-bottom: 1px solid #c06f01; box-shadow: 0px 2px 2px 0px rgba(0, 0, 0, 0.10); background: #f5a802; background: linear-gradient(to bottom, #fcd054 0%, #f5a802 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#fcd054', endColorstr='#f5a802', GradientType=0 ); }";
  webpage += "    .ct-btn.yellow:hover { background: #ffb618; background: linear-gradient(to bottom, #ffdc78 0%, #ffb618 100%); filter: progid:DXImageTransform.Microsoft.gradient( startColorstr='#ffdc78', endColorstr='ffb618', GradientType=0 ); }";
  webpage += "    .ct-btn.yellow:active,";
  webpage += "    .ct-btn.yellow.active { border-color: #efa80d; border-top-color: #cf8e00; background: #ffb618; box-shadow: none; text-shadow: none; }";
  webpage += "  </style>";
  webpage += "</head>";
}

