ZalophusDokdo/LED_Matrix_Bar_Weather_Station/ESP8266/ESP8266_LED_Matrix_Bar_Weather_Station/Web_Server.h
void update_webpage() {
  append_webpage_header();
  IPAddress ip = WiFi.localIP();
  String ipStr = String(ip[0]) + '.' + String(ip[1]) + '.' + String(ip[2]) + '.' + String(ip[3]);
  // Return the response
  webpage += "<body>";
  webpage += "  <div id='jb-container'>";
  webpage += "    <div id='jb-header'>";
  webpage += "      <center><a style='TEXT-DECORATION: none' href='./'><h1>" + webTitle + "<br>" + webSubTitle + "</h1></a></center>";
  webpage += "    </div>";
  webpage += "    <div id='jb-content'>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<b>[ Weather Forecast ]</b><br>";
  webpage += "<a href=\"/\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 26px'>" + weatherDescription + "</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "          <a href=\"/weatherSCROLL\"\">";
  webpage += "<button type='submit' class='ct-btn white en-01' style='font-size: 14px'>";
  webpage += String(country) + "<br>";
  webpage += date + "<br>";
  if (am_pm == 12) {
    webpage += "[ " + String(ampm) + " " + String(int(h)) + ":" + String(int(m)) + " ]<br>";
  } else {
    webpage += "[ " + String(int(h)) + ":" + String(int(m)) + " ]<br>";
  }
  webpage += "Temp     : " + String(temp,1)      + " 'C ( " + String(tempMin,1) + " 'C - " + String(tempMax,1) + " 'C ) <br>";
  webpage += "Humidity : " + String(humidity)    + " %  <br>";
  webpage += "Pressure : " + String(pressure)    + " hPa  <br>";
  webpage += "Clouds   : " + String(clouds)      + " %  <br>";
  webpage += "Wind     : " + String(windSpeed,1) + " m/s <br>";
  webpage += "</button></a><br>";
  webpage += "<hr>";  // ===========================================================
  webpage += "<a href=\"/repeatprintMsg\"\"><button class='ct-btn white en-01' style='font-size: 12px'>";
  webpage += printMsg;
  webpage += "</button></a>";
  webpage += "            <br>";
  webpage += "            Type your message<br>";
  webpage += "            <form action='msg'>";
  webpage += "              <input type='text' name='msg' size=35% autofocus><br>";
  webpage += "              <input class='ct-btn blue en-01' style='font-size: 26px' type='submit' value='Submit'>";
  webpage += "            </form>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#if defined(USE_DHT) || defined(USE_DHT12)
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  #ifndef USE_DHT
    outdoor = 1;
  #endif
  #ifndef USE_DHT12
    indoor  = 1;
  #endif
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  #ifdef USE_DHT
    if (indoor == 1) {
      if(dhtGet == 0) {
        webpage += "    <td>";
        webpage += " < ";
        webpage += dhtCTemp;
        webpage += " 'C >";
        webpage += "    </td>";
      }
    }
  #endif
  #ifdef USE_DHT12
    if (outdoor == 1) {
      if(dht12get == 0) {
        webpage += "    <td>";
        webpage += " < ";
        webpage += dht12.readTemperature();
        webpage += " 'C >";
        webpage += "    </td>";
      }
    }
  #endif
  #ifdef USE_DHT
    if (indoor == 1) {
      webpage += "      <td><b>INDOOR</b>";
      webpage += "      </td>";
    }
  #endif
  #ifdef USE_DHT12
    if (outdoor == 1) {
      webpage += "      <td><b>" + webInternalTempTitle + "</b>";
      webpage += "      </td>";
    }
  #endif
  #ifdef USE_DHT
    if (indoor == 1) {
      if(dhtGet == 0) {
        webpage += "    <td>";
        webpage += " < ";
        webpage += dhtHumidity;
        webpage += " % >";
        webpage += "    </td>";
      }
    }
  #endif
  #ifdef USE_DHT12
    if (outdoor == 1) {
      if(dht12get == 0) {
        webpage += "    <td>";
        webpage += " < ";
        webpage += dht12.readHumidity();
        webpage += " % >";
        webpage += "    </td>";
      }
    }
  #endif
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "            <table align='center' width='100%'>";
  webpage += "              <tr align='center'>";
  #ifdef USE_DHT
    if (indoor == 1) {
    #ifndef USE_DHT12
      webpage += "            <td>";
      if (dht.readTemperature() > 35 && dht.readHumidity() > 60) { 
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 44px'>-- Hot --</button></a>";
      } else if (dht.readTemperature() > 29 && dht.readHumidity() > 40) { 
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 44px'>- Warm -</button></a>";
      } else if (dht.readTemperature() < 20 && dht.readHumidity() < 30) {
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 44px'>- Cold -</button></a>";
      } else {
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 44px'>- Good -</button></a>";
      }
      webpage += "            </td>";
    #else
      webpage += "            <td>";
      if (dht.readTemperature() > 35 && dht.readHumidity() > 60) { 
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 44px'>-- Hot --</button></a>";
      } else if (dht.readTemperature() > 29 && dht.readHumidity() > 40) { 
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 44px'>- Warm -</button></a>";
      } else if (dht.readTemperature() < 20 && dht.readHumidity() < 30) {
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 44px'>- Cold -</button></a>";
      } else {
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 44px'>- Good -</button></a>";
      }
      webpage += "            </td>";
    #endif
  }
  #endif
  #ifdef USE_DHT12
    if (outdoor == 1) {
    #ifndef USE_DHT
      webpage += "            <td>";
      if (dht12.readTemperature() > 35 && dht12.readHumidity() > 60) { 
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 44px'>-- Hot --</button></a>";
      } else if (dht12.readTemperature() > 29 && dht12.readHumidity() > 40) { 
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 44px'>- Warm -</button></a>";
      } else if (dht12.readTemperature() < 20 && dht12.readHumidity() < 30) {
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 44px'>- Cold -</button></a>";
      } else {
        webpage += "<a href=\"/outDoor\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 44px'>- Good -</button></a>";
      }
      webpage += "            </td>";
    #else
      webpage += "            <td>";
      if (dht12.readTemperature() > 35 && dht12.readHumidity() > 60) { 
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 44px'>-- Hot --</button></a>";
      } else if (dht12.readTemperature() > 29 && dht12.readHumidity() > 40) { 
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 44px'>- Warm -</button></a>";
      } else if (dht12.readTemperature() < 20 && dht12.readHumidity() < 30) {
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 44px'>- Cold -</button></a>";
      } else {
        webpage += "<a href=\"/inDoor\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 44px'>- Good -</button></a>";
      }
        webpage += "          </td>";
    #endif
    }
  #endif
  webpage += "              </tr>";
  webpage += "            </table>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#endif
#ifdef USE_LED_MATRIX
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
 #ifndef USE_TIMER
  webpage += "          <td>";
  if (dateScroll == 0) {
    webpage += "<a href=\"/dateScrollOn\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>----------<br>Scrolling<br>Date<br>----------</button></a>";
  } else {
    webpage += "<a href=\"/dateScrollOff\"\"><button class='ct-btn yellow en-01' style='font-size: 14px'>----------<br>Scrolling<br>Date<br>----------</button></a>";
  }
  webpage += "          </td>";
 #endif
  #ifdef USE_LED_MATRIX
    webpage += "        <td>";
    if (weatherScroll == 1 || dateScroll == 1) {
      webpage += "<a href=\"/scroll12off\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 14px'>Full<br>Scroll Off</button></a>";
    } else {
      webpage += "<a href=\"/scroll12on\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 14px'>Full<br>Scroll On</button></a>";
    };
    webpage += "        </td>";
  #endif
 #ifndef USE_TIMER
  webpage += "          <td>";
  if (weatherScroll == 0) {
    webpage += "<a href=\"/weatherScrollOn\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>----------<br>Scrolling<br>Weather<br>----------</button></a>";
  } else {
    webpage += "<a href=\"/weatherScrollOff\"\"><button class='ct-btn yellow en-01' style='font-size: 14px'>----------<br>Scrolling<br>Weather<br>----------</button></a>";
  }
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  #if defined(USE_DHT)
    #ifdef USE_DHT
      webpage += "      <td>";
      if (indoorScroll == 0) {
        webpage += "<a href=\"/inDoorScrollOn\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>------------------<br>Scrolling<br>INDOOR<br>On<br>----------</button></a>";
      } else {
        webpage += "<a href=\"/inDoorScrollOff\"\"><button class='ct-btn yellow en-01' style='font-size: 14px'>------------------<br>Scrolling<br>INDOOR<br>----------</button></a>";
      }
      webpage += "      </td>";
    #endif
  #endif
  #if defined(USE_DHT12)
    #ifdef USE_DHT12
      webpage += "      <td>";
      if (outdoorScroll == 0) {
        webpage += "<a href=\"/outDoorScrollOn\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>------------------<br>Scrolling<br>OUTDOOR<br>On<br>----------</button></a>";
      } else {
        webpage += "<a href=\"/outDoorScrollOff\"\"><button class='ct-btn yellow en-01' style='font-size: 14px'>------------------<br>Scrolling<br>OUTDOOR<br>----------</button></a>";
      }
      webpage += "      </td>";
    #endif
  #endif
  webpage += "        </tr>";
  webpage += "      </table>";
/*
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td><a href=\"/button00\"\"><button class='ct-btn white en-01' style='font-size: 12px'>----------<br>I<br>love<br>you<br>----------</button></a></td>";
  webpage += "          <td><a href=\"/button01\"\"><button class='ct-btn white en-01' style='font-size: 12px'>----------<br>Don't<br>get<br>upset<br>----------</button></a></td>";
  webpage += "          <td><a href=\"/button02\"\"><button class='ct-btn white en-01' style='font-size: 12px'>----------<br>I'm<br>upset<br><br>----------</button></a></td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "         <td><a href=\"/button03\"\"><button class='ct-btn white en-01' style='font-size: 12px'>----------<br>Catch me<br>if<br>you can<br>----------</button></a></td>";
  webpage += "          <td><a href=\"/button04\"\"><button class='ct-btn white en-01' style='font-size: 12px'>----------<br>You will<br>never know<br>until you try<br>----------</button></a></td>";
  webpage += "          <td><a href=\"/button05\"\"><button class='ct-btn white en-01' style='font-size: 12px'>----------<br>Pain past<br>is<br>pleasure<br>----------</button></a></td>";
  webpage += "        </tr>";
  webpage += "      </table>";
 */
 #endif
#endif
#if defined(DEV_BOARD_Witty) || defined(DEV_BOARD_WiFi_RELAY_MODULE)
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  #ifdef USE_LIGHT
  webpage += "        <tr>";
  webpage += "          <td>";
  #ifdef DEV_BOARD_Witty
  if (digitalRead(USE_LIGHT_PIN) || light05on_state == 1) {
  #endif
  #ifdef DEV_BOARD_WiFi_RELAY_MODULE 
  if (digitalRead(USE_INPUT_PIN) || light05on_state == 1) {
  #endif
    webpage += "<a href=\"/light05off\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 14px'>----------<br>Lamp<br>Off<br>----------</button></a>";
  } else {
    webpage += "<a href=\"/light05on\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 14px'>----------<br>Lamp<br>On<br>----------</button></a>";
  }
  webpage += "          </td>";
  webpage += "        </tr>";
  #endif
  webpage += "      </table>";
#endif
#ifdef   USE_RGB_LED_NEOPIXEL
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<b>[ RGB LED (WS2812B) ]</b><br>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledRed\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 14px'>--------<br>Red<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledGreen\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 14px'>--------<br>Green<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledBlue\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 14px'>--------<br>Blue<br>------</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledWhite\"\"><button type='submit' class='ct-btn White en-01' style='font-size: 14px'>--------<br>White<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  if (digitalRead(GREEN_PIN)) { 
    webpage += "<a href=\"/lamp00off\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 14px'>----------<br>Lamp<br>Off<br>----------</button></a>";
  } else {
    webpage += "<a href=\"/lamp00on\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 14px'>----------<br>Lamp<br>On<br>----------</button></a>";
  }
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledBlank\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 14px'>--------<br>Blank<br>------</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#endif
#ifdef   USE_RGB_LED_DIRECT
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<b>[ RGB LED Direct ]</b><br>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledDirectRed\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 14px'>--------<br>Red<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledDirectGreen\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 14px'>--------<br>Green<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledDirectBlue\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 14px'>--------<br>Blue<br>------</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledDirectWhite\"\"><button type='submit' class='ct-btn white en-01' style='font-size: 14px'>--------<br>White<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledDirectBlank\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 14px'>--------<br>Blank<br>------</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#endif
#ifdef   USE_RGB_LED_STRIP_DRIVER
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<b>[ RGB LED Strip Driver ]</b><br>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledStripRed\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 14px'>--------<br>Red<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledStripGreen\"\"><button type='submit' class='ct-btn green en-01' style='font-size: 14px'>--------<br>Green<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledStripBlue\"\"><button type='submit' class='ct-btn blue en-01' style='font-size: 14px'>--------<br>Blue<br>------</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledStripWhite\"\"><button type='submit' class='ct-btn white en-01' style='font-size: 14px'>--------<br>White<br>------</button></a>";
  webpage += "          </td>";
  webpage += "          <td>";
  webpage += "<a href=\"/ledStripBlank\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 14px'>--------<br>Blank<br>------</button></a>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#endif
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<b>[ Clock ]</b><br>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  if (showAnimClockSW == 0) {
    webpage += "<a href=\"/showAnimClockOn\"\"><button class='ct-btn green en-01' style='font-size: 14px'>- Show Animation Clock -</button></a>";
  } else {
    webpage += "<a href=\"/showAnimClockOff\"\"><button class='ct-btn yellow en-01' style='font-size: 14px'>- Show Simple Clock -</button></a>";
  }
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  if (Clock == 0) {
    webpage += "<a href=\"/ClockOn\"\"><button class='ct-btn red en-01' style='font-size: 14px'>- Clock On -</button></a>";
  } else {
    webpage += "<a href=\"/ClockOff\"\"><button class='ct-btn green en-01' style='font-size: 14px'>- Clock Off -</button></a>";
  }
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  if (digitalRead(RED_PIN)) { 
    webpage += "<a href=\"/alarm16off\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 26px'>Alarm Off</button></a>";
  } else {
    webpage += "<a href=\"/alarm16on\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 26px'>Alarm On</button></a>";
  };
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "    Alarm Setting<br>";
  webpage += "            <form action='alarmTime'>";
  if (am_pm == 12) {
    webpage += "          <label for='ampm'>Choose a AM/PM:</label><br>";
    webpage += "          <select id='ampm' name='ampm'>";
    if (alarm_ampm_select == "AM") {
      webpage += "          <option value='AM' selected='selected'>AM</option>";
    } else {
      webpage += "          <option value='AM'>AM</option>";
    }
    if (alarm_ampm_select == "PM") {
      webpage += "          <option value='PM' selected='selected'>PM</option>";  
    } else {
      webpage += "          <option value='PM'>PM</option>";  
    }
    webpage += "          </select>";
    webpage += "          <input type='number' min='01' max='12' name='alarm_h_time' value='";
    webpage += String(alarm_h_set);
    webpage += "' size=10% autofocus>:";
  } else {
    webpage += "          <input type='number' min='00' max='23' name='alarm_h_time' value='";
    webpage += String(alarm_h_set);
    webpage += "' size=10% autofocus>:";
  }
  webpage += "            <input type='number' min='00' max='59' name='alarm_m_time' value='";
  webpage += String(alarm_m_set);
  webpage += "' size=10% autofocus> ";
  webpage += "            <input class='ct-btn blue en-01' style='font-size: 12px' type='submit' value='Submit'>";
