ZalophusDokdo/LED_Matrix_Bar_Weather_Station/ESP8266/ESP8266_LED_Matrix_Bar_Weather_Station/Web_Server.h
  webpage += "            </form>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td><a href=\"/ampmOnOff\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>AM-PM On/Off</button></a></td>";
  webpage += "          <td></td>";
  webpage += "          <td><a href=\"/onTimeALARM\"\"><button class='ct-btn green en-01' style='font-size: 14px'>On-time Alarm</button></a></td>";
//  webpage += "          <td></td>";
//  webpage += "          <td><a href=\"/alarmOnOff\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>Alarm</button></a></td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#ifdef USE_TIMER  
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "<b>[ Timer ]</b><br>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "    Start Time<br>";
  webpage += "            <form action='timerStart'>";
  if (am_pm == 12) {
    webpage += "          <label for='ampm'>Choose a AM/PM:</label><br>";
    webpage += "          <select id='ampm' name='ampm'>";
    if (timer_start_ampm_select == "AM") {
      webpage += "          <option value='AM' selected='selected'>AM</option>";
    } else {
      webpage += "          <option value='AM'>AM</option>";
    }
    if (timer_start_ampm_select == "PM") {
      webpage += "          <option value='PM' selected='selected'>PM</option>";  
    } else {
      webpage += "          <option value='PM'>PM</option>";  
    }
    webpage += "          </select>";
    webpage += "          <input type='number' min='01' max='12' name='timer_h_time' value='";
    webpage += String(timer_h_start);
    webpage += "' size=10% autofocus>:";
  } else {
    webpage += "          <input type='number' min='00' max='23' name='timer_h_time' value='";
    webpage += String(timer_h_start);
    webpage += "' size=10% autofocus>:";
  }
  webpage += "            <input type='number' min='00' max='59' name='timer_m_time' value='";
  webpage += String(timer_m_start);
  webpage += "' size=10% autofocus> ";
  webpage += "            <input class='ct-btn blue en-01' style='font-size: 12px' type='submit' value='Submit'>";
  webpage += "            </form>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  webpage += "    Stop Time<br>";
  webpage += "            <form action='timerStop'>";
  if (am_pm == 12) {
    webpage += "          <label for='ampm'>Choose a AM/PM:</label><br>";
    webpage += "          <select id='ampm' name='ampm'>";
    if (timer_stop_ampm_select == "AM") {
      webpage += "          <option value='AM' selected='selected'>AM</option>";
    } else {
      webpage += "          <option value='AM'>AM</option>";
    }
    if (timer_stop_ampm_select == "PM") {
      webpage += "          <option value='PM' selected='selected'>PM</option>";  
    } else {
      webpage += "          <option value='PM'>PM</option>";  
    }
    webpage += "          </select>";
    webpage += "          <input type='number' min='01' max='12' name='timer_h_time' value='";
    webpage += String(timer_h_stop);
    webpage += "' size=10% autofocus>:";
  } else {
    webpage += "          <input type='number' min='00' max='23' name='timer_h_time' value='";
    webpage += String(timer_h_stop);
    webpage += "' size=10% autofocus>:";
  }
  webpage += "            <input type='number' min='00' max='59' name='timer_m_time' value='";
  webpage += String(timer_m_stop);
  webpage += "' size=10% autofocus> ";
  webpage += "            <input class='ct-btn blue en-01' style='font-size: 12px' type='submit' value='Submit'>";
  webpage += "            </form>";
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td>";
  if (timer_state == 1) { 
    webpage += "<a href=\"/timerOff\"\"><button type='submit' class='ct-btn yellow en-01' style='font-size: 26px'>Timer Off</button></a>";
  } else {
    webpage += "<a href=\"/timerOn\"\"><button type='submit' class='ct-btn red en-01' style='font-size: 26px'>Timer On</button></a>";
  };
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
#endif
  webpage += "    </div>";
  webpage += "    <div id='jb-sidebar'>";
  webpage += "      <table>";
  webpage += "        <tr><td><H3>Hello, you successfully connected to " + webTitle + "!</H3></td></tr>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "Project: ";
  webpage += projectName;
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "Version: ";
  webpage += projectVersion;
  webpage += "          <br>";
  webpage += "IP address: ";
  webpage += ipStr;
  webpage += "          <br>";
  webpage += "MAC address: ";
  webpage += MAC_char;
  webpage += "          <br>";
  webpage += "mDNS: <br>";
  webpage += "<a href='http://";
  webpage += APname;
  webpage += ".local/\'>";
  webpage += "http://";
  webpage += APname;
  webpage += ".local/";
  webpage += "</a>";
  webpage += "          <br>";
  webpage += "<hr>";  // ===========================================================
#ifdef USE_DS18B20
  webpage += "[ DS18B20 ] - INSIDE<br>";
  if (ds18b20get == 0) {
    webpage += "    - ";
    webpage += "Temperature: ";
    webpage += sensors.getTempCByIndex(0);
    webpage += " 'C ( ";
    webpage += sensors.getTempFByIndex(0);
    webpage += " 'F )<br>";
    #ifdef USE_DS18B20_A
      webpage += "  - ";
      webpage += "Temperature: ";
      webpage += sensors.getTempCByIndex(1);
      webpage += " 'C ( ";
      webpage += sensors.getTempFByIndex(1);
      webpage += " 'F )<br>";
    #endif
  } else if (ds18b20get == 1){
    webpage += "  - <font color='red'>Sensor error or disconnected</font><br>";
  }
#endif
#ifdef USE_DHT
  webpage += "[ DHT";
  webpage += DHTTYPE;
  webpage += " ] - INDOOR<br>";
  if (dhtGet == 0) {
  webpage += "    - ";
  webpage += "Temperature: ";
  webpage += dhtCTemp;
  webpage += " 'C ( ";
  webpage += dhtFTemp;
  webpage += " 'F )<br>";
  webpage += "    - ";
  webpage += "Humidity: ";
  webpage += dhtHumidity;
  webpage += " %<br>";
  } else {
  webpage += "    - <font color='red'>Sensor error or disconnected</font><br>";
  }
#endif
#ifdef USE_DHT12
  webpage += "[ DHT12 ] - " + webInternalTempTitle + "<br>";
  if (dht12get == 0) {
  webpage += "    - ";
  webpage += "Temperature: ";
  webpage += dht12.readTemperature();
  webpage += " 'C ( ";
  webpage += dht12.readTemperature(true);
  webpage += " 'F )<br>";
  webpage += "    - ";
  webpage += "Humidity: ";
  webpage += dht12.readHumidity();
  webpage += " %<br>";
  } else {
  webpage += "    - <font color='red'>Sensor error or disconnected</font><br>";
  }
#endif
  int   iA00 = A0;  // Battery Monitor: ADC0(Analog Input)
  float voltage;
  voltage = analogRead(iA00) / 92.25;  // 11.1V(92.25), 9V(113.77), 7.2V(142.22), 5V(204.8), 3.3V(310.3)
  webpage += "[ Power ]<br>";
  webpage += "- Voltage: ";
  webpage += voltage;
  webpage += " Volt (External)<br>";
  float bat_level_int = readvdd33() / 1000.0;  // Internal Voltage Monitor: A0(Analog Input)
  webpage += "- Voltage: ";
  webpage += bat_level_int;
  webpage += " Volt (Internal)<br>";
#ifdef USE_LED_MATRIX
/*
  webpage += "<hr>";  // ===========================================================
  webpage += "[ LED Matrix Status ]<br>";
  webpage += "    - Clock: ";
  if (Clock == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
  webpage += "    - Date Scroll: ";
  if (dateScroll == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
  webpage += "    - Weather Scroll: ";
  if (weatherScroll == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
  webpage += "    - INDOOR Scroll: ";
  if (indoorScroll == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
  webpage += "    - OUTDOOR Scroll: ";
  if (outdoorScroll == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
  webpage += "<hr width='70%'>";  // ===============================================
  webpage += "    - Number of MAX7219's: ";
  webpage += NUM_MAX;
  webpage += "<br>";
  webpage += "    - Initial LED Matrix intensity(1-15): ";
  webpage += SET_INTENSITY;
  webpage += "<br>";
  webpage += "    - Weather scroll interval: ";
  int weatherScrollInterval = WEATHER_SCROLL_INTERVAL / 1000;
  webpage += weatherScrollInterval;
  webpage += " sec<br>";
  webpage += "    - String shift delay time: ";
  int stringShiftDelayTime = STRING_SHIFT_DELAY;
  webpage += stringShiftDelayTime;
  webpage += " msec<br>";
  webpage += "    - Update time interval: ";
  int updateTimeCount = UPDATE_TIME_COUNT * 0.75;
  webpage += updateTimeCount;
  webpage += " minute<br>";
 */
#endif
  webpage += "<hr>";  // ===========================================================
  webpage += "[ Clock ]<br>";
  webpage += "    - Coordinated Universal Time(UTC): ";
  webpage += utcOffset;
  webpage += "<br>";
  webpage += "    - AM-PM Mode: ";
  if (am_pm == 12) {
    webpage += "On, 12-hour clock<br>";
  } else {
    webpage += "Off, 24-hour clock<br>";
  }
    webpage += "    - Alarm Setting Status: ";
  if (alarm_state == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
    webpage += "    - Alarm Time: ";
  if (onTimeAlarm == 1) {
    webpage += "On-Time";
  } else {
    if (am_pm == 12) {
      webpage += String(alarm_ampm_select) + " " + String(alarm_h_set) + ":" + String(alarm_m_set);
    } else {
      webpage += String(alarm_h_set) + ":" + String(alarm_m_set);
    }
  }
  webpage += "<br>";
#ifdef USE_TIMER
  webpage += "[ Timer ]<br>";
    webpage += "    - Timer Setting Status: ";
  if (timer_state == 1) {
    webpage += "On<br>";
  } else {
    webpage += "Off<br>";
  }
  webpage += "      - Start Time: ";
  if (am_pm == 12) {
    webpage += String(timer_start_ampm_select) + " " + String(timer_h_start) + ":" + String(timer_m_start);
  } else {
    webpage += String(timer_h_start) + ":" + String(timer_m_start);
  }
  webpage += "<br>";
  webpage += "      - Stop Time: ";
  if (am_pm == 12) {
    webpage += String(timer_stop_ampm_select) + " " + String(timer_h_stop) + ":" + String(timer_m_stop);
  } else {
    webpage += String(timer_h_stop) + ":" + String(timer_m_stop);
  }
  webpage += "<br>";
#endif
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center' width='100%'>";
  webpage += "        <tr>";
  webpage += "          <td>";
  webpage += "<hr>";  // ===========================================================
  webpage += "          </td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "      <table align='center'>";
  webpage += "        <tr align='center'>";
  webpage += "          <td><a href=\"/updateDATA\"\"><button class='ct-btn green en-01' style='font-size: 14px'>Update Data</button></a></td>";
  webpage += "          <td></td>";
  webpage += "          <td><a href=\"/ESPrestart\"\"><button class='ct-btn blue en-01' style='font-size: 14px'>Restart</button></a></td>";
  webpage += "          <td></td>";
  webpage += "          <td><a href=\"/resetAP\"\"><button class='ct-btn red en-01' style='font-size: 14px'>Reset AP</button></a></td>";
  webpage += "        </tr>";
  webpage += "      </table>";
  webpage += "    </div>";
  webpage += "    <div id='jb-footer'>";
  webpage += "      <a style='TEXT-DECORATION: none' href='https://zalophus.tistory.com/' target='_blank'>Copyright &copy; 2012 Zalophus's DesignHouse All rights reserved.</a>";
  webpage += "     [<a style='TEXT-DECORATION: none' href='https://github.com/ZalophusDokdo/LED_Matrix_Bar_Weather_Station' target='_blank'>GitHub</a>]";
  webpage += "    </div>";
  webpage += "  </div>";
  webpage += "</body>";
  webpage += "</html>";
}

void home_page() { 
#ifdef USE_DS18B20
  DS18B20_action();
#endif
#ifdef USE_DHT
  DHT_action();
#endif
#ifdef USE_DHT12
  DHT12_action();
#endif
  update_webpage();
  server.send(200, "text/html", webpage); 
} 

void weatherSCROLL() {
#ifdef USE_LED_MATRIX
  LEDMatrix_Date_action();
  LEDMatrix_Weather_action();
#endif
  home_page();
  delay(waitScroll);
}

void Clock_On() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Clock On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  Clock = 1;
  home_page();
  delay(waitScroll);
}
void Clock_Off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Clock Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  Clock = 0;
  home_page();
  delay(waitScroll);
}
void showAnimClock_On() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Show Animation Clock On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  showAnimClockSW = 1;
  home_page();
  delay(waitScroll);
}
void showAnimClock_Off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Show Simple Clock On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  showAnimClockSW = 0;
  home_page();
  delay(waitScroll);
}

void dateScroll_On() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Date Scroll On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  dateScroll = 1;
  home_page();
  delay(waitScroll);
}
void dateScroll_Off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Date Scroll Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  dateScroll = 0;
  home_page();
  delay(waitScroll);
}

void weatherScroll_On() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Weather Scroll On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  weatherScroll = 1;
  home_page();
  delay(waitScroll);
}
void weatherScroll_Off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Weather Scroll Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  weatherScroll = 0;
  home_page();
  delay(waitScroll);
}

void updateDATA() {
#ifdef USE_LED_MATRIX
  printStringWithShift("   Getting data", 15);
#endif
  ntpTime();
  getWeatherData();
  delay(waitScroll);
  LEDMatrix_Clock_action();
  home_page();
  delay(waitScroll);
}

