ZalophusDokdo/LED_Matrix_Bar_Weather_Station/ESP8266/ESP8266_LED_Matrix_Bar_Weather_Station/Web_Server.h
void ESPrestart() {
  ESP.restart();
  home_page();
  delay(waitScroll);
}

void resetAP() {
  WiFiManager wifiManager;
  wifiManager.resetSettings();
}

void OTAmodeOn() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("OTA mode On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  OTAmode = 1;
  home_page();
  delay(waitScroll);
}
void OTAmodeOff() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("OTA mode Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  OTAmode = 0;
  home_page();
  delay(waitScroll);
}

void handle_msg() {
  String msg           = server.arg("msg");
  Serial.println(msg);
  String decodedMsg    = msg;
  // Restore special characters that are misformed to %char by the client browser
  decodedMsg.replace("+", " ");
  decodedMsg.replace("%21", "!");
  decodedMsg.replace("%22", "");
  decodedMsg.replace("%23", "#");
  decodedMsg.replace("%24", "$");
  decodedMsg.replace("%25", "%");
  decodedMsg.replace("%26", "&");
  decodedMsg.replace("%27", "'");
  decodedMsg.replace("%28", "(");
  decodedMsg.replace("%29", ")");
  decodedMsg.replace("%2A", "*");
  decodedMsg.replace("%2B", "+");
  decodedMsg.replace("%2C", ",");
  decodedMsg.replace("%2F", "/");
  decodedMsg.replace("%3A", ":");
  decodedMsg.replace("%3B", ";");
  decodedMsg.replace("%3C", "<");
  decodedMsg.replace("%3D", "=");
  decodedMsg.replace("%3E", ">");
  decodedMsg.replace("%3F", "?");
  decodedMsg.replace("%40", "@");
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift(decodedMsg.c_str(), stringShiftDelay);
#endif
  printMsg = decodedMsg;
  home_page();
  delay(waitScroll);
}

void repeatprintMsg() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift(printMsg.c_str(), stringShiftDelay);
#endif
  home_page();
  delay(waitScroll);
}

void inDoor() {
#ifdef USE_DHT
  LEDMatrix_DHT_action();
#endif
  indoor  = 1;
  outdoor = 0;
  home_page();
  delay(waitScroll);
}

void outDoor() {
#ifdef USE_DHT12
  LEDMatrix_DHT12_action();
#endif
  }
#endif
  indoor  = 0;
  outdoor = 1;
  home_page();
  delay(waitScroll);
}

void inDoorScrollOn() {
#ifdef USE_DHT
#ifdef USE_LED_MATRIX
  if (dhtGet == 0) {
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("INDOOR Scroll On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
  }
#endif
  indoorScroll  = 1;
  home_page();
  delay(waitScroll);
#endif
}
void inDoorScrollOff() {
#ifdef USE_DHT
#ifdef USE_LED_MATRIX
  if (dhtGet == 0) {
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("INDOOR Scroll Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
  }
#endif
  indoorScroll  = 0;
  home_page();
  delay(waitScroll);
#endif
}

void outDoorScrollOn() {
#ifdef USE_DHT12
#ifdef USE_LED_MATRIX
  if (dht12get == 0) {
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("OUTDOOR Scroll On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
  }
#endif
  outdoorScroll = 1;
  home_page();
  delay(waitScroll);
#endif
}
void outDoorScrollOff() {
#ifdef USE_DHT12
#ifdef USE_LED_MATRIX
  if (dht12get == 0) {
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("OUTDOOR Scroll Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
  }
#endif
  outdoorScroll = 0;
  home_page();
  delay(waitScroll);
#endif
}

void alarm16on() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Alarm On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  digitalWrite(RED_PIN, HIGH);
  alarm_state = 1;
  home_page();
  delay(waitScroll);
}
void alarm16off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Alarm Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  digitalWrite(RED_PIN,  LOW);
  alarm_state = 0;
  home_page();
  delay(waitScroll);
}

#if defined(DEV_BOARD_Witty) || defined(DEV_BOARD_WiFi_RELAY_MODULE)
  #ifdef USE_LIGHT
void light05on() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Light Turn On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
#ifdef DEV_BOARD_Witty
  digitalWrite(USE_LIGHT_PIN, HIGH);
#endif
#ifdef DEV_BOARD_WiFi_RELAY_MODULE
  digitalWrite(USE_INPUT_PIN, HIGH);
#endif
  light05on_state = 1;
  home_page();
  delay(waitScroll);
}
void light05off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Light Turn Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
#ifdef DEV_BOARD_Witty
  digitalWrite(USE_LIGHT_PIN,  LOW);
#endif
#ifdef DEV_BOARD_WiFi_RELAY_MODULE
  digitalWrite(USE_INPUT_PIN,  LOW);
#endif
  light05on_state = 0;
  home_page();
  delay(waitScroll);
}
  #endif
#endif

void lamp00on() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Lamp Turn On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  digitalWrite(GREEN_PIN, HIGH);
#ifdef   USE_RGB_LED_DIRECT
  digitalWrite(RGB_LED_RED_PIN, HIGH); digitalWrite(RGB_LED_GREEN_PIN, HIGH); digitalWrite(RGB_LED_BLUE_PIN, HIGH);
#endif
#ifdef   USE_RGB_LED_NEOPIXEL
  button00count++;
  if (button00count == 1) {
    colorWipe(strip.Color(255, 255, 255), 10);     // White
  } else if (button00count == 2) {
    colorWipe(strip.Color(255,   0,   0), 50);     // Red
    colorWipe(strip.Color(  0, 255,   0), 50);     // Green
    colorWipe(strip.Color(  0,   0, 255), 50);     // Blue
    colorWipe(strip.Color(255, 255, 255), 50);     // White
    //colorWipe(strip.Color(  0,   0,   0), 50);     // Black
  } else if (button00count == 3) {
    theaterChase(strip.Color(127,   0,   0), 20);  // Red
    theaterChase(strip.Color(  0, 127,   0), 20);  // Green
    theaterChase(strip.Color(  0,   0, 127), 20);  // Blue
    theaterChase(strip.Color(127, 127, 127), 20);  // White
  } else if (button00count == 4) {
    rainbow(20);
  } else if (button00count == 5) {
    rainbowCycle(20);
  } else if (button00count == 6) {
    theaterChaseRainbow(30);
    button00count = 0;
  }
#endif
  home_page();
  delay(waitScroll);
}
void lamp00off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Lamp Turn Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  digitalWrite(GREEN_PIN,  LOW);  
#ifdef   USE_RGB_LED_DIRECT
  digitalWrite(RGB_LED_RED_PIN, LOW); digitalWrite(RGB_LED_GREEN_PIN, LOW); digitalWrite(RGB_LED_BLUE_PIN, LOW);
#endif
#ifdef   USE_RGB_LED_NEOPIXEL
    colorWipe(strip.Color(  0,   0,   0),  10);
#endif
  home_page();
  delay(waitScroll);
}

void scroll12on() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Scroll On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  dateScroll = 1;
#ifdef   USE_DHT
  indoorScroll = 1;
#endif
#ifdef   USE_DHT12
  outdoorScroll = 1;
#endif
  weatherScroll = 1;
  home_page();
  delay(waitScroll);
}
void scroll12off() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Scroll Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  dateScroll = 0;
#ifdef USE_DHT
  indoorScroll = 0;
#endif
#ifdef USE_DHT12
  outdoorScroll = 0;
#endif
  weatherScroll = 0;
  home_page();
  delay(waitScroll);
}

#ifdef USE_RGB_LED_NEOPIXEL
// NeoPixel ====================================================================
void ledRed()                 { colorWipe(strip.Color(255,   0,   0), 20); home_page(); delay(waitScroll); }  // Red
void ledGreen()               { colorWipe(strip.Color(  0, 255,   0), 20); home_page(); delay(waitScroll); }  // Green
void ledBlue()                { colorWipe(strip.Color(  0,   0, 255), 20); home_page(); delay(waitScroll); }  // Blue
void ledWhite()               { colorWipe(strip.Color(255, 255, 255), 20); home_page(); delay(waitScroll); }  // White
void ledBlank()               { colorWipe(strip.Color(  0,   0,   0), 20); home_page(); delay(waitScroll); }  // Blank
#endif

