ZalophusDokdo/LED_Matrix_Bar_Weather_Station/ESP8266/ESP8266_LED_Matrix_Bar_Weather_Station/Web_Server.h
// RGB LED Direct ==============================================================
#ifdef USE_RGB_LED_DIRECT
void ledDirectRed()   { digitalWrite(RGB_LED_RED_PIN,   HIGH); digitalWrite(RGB_LED_GREEN_PIN,  LOW); digitalWrite(RGB_LED_BLUE_PIN,   LOW); home_page(); delay(waitScroll); }  // Red
void ledDirectGreen() { digitalWrite(RGB_LED_RED_PIN,    LOW); digitalWrite(RGB_LED_GREEN_PIN, HIGH); digitalWrite(RGB_LED_BLUE_PIN,   LOW); home_page(); delay(waitScroll); }  // Green
void ledDirectBlue()  { digitalWrite(RGB_LED_RED_PIN,    LOW); digitalWrite(RGB_LED_GREEN_PIN,  LOW); digitalWrite(RGB_LED_BLUE_PIN,  HIGH); home_page(); delay(waitScroll); }  // Blue
void ledDirectWhite() {  // White
  digitalWrite(RGB_LED_RED_PIN,   HIGH);
  digitalWrite(RGB_LED_GREEN_PIN, HIGH);
  digitalWrite(RGB_LED_BLUE_PIN,  HIGH);
  home_page();
  delay(waitScroll);
}
void ledDirectBlank() {  // Blank
  digitalWrite(RGB_LED_RED_PIN,    LOW);
  digitalWrite(RGB_LED_GREEN_PIN,  LOW);
  digitalWrite(RGB_LED_BLUE_PIN,   LOW);
  home_page();
  delay(waitScroll);
}
#endif

// RGB LED Strip Driver ========================================================
#ifdef USE_RGB_LED_STRIP_DRIVER
void ledStripRed()    { led.setColor(255,   0,   0); home_page(); delay(waitScroll); }  // Red
void ledStripGreen()  { led.setColor(  0, 255,   0); home_page(); delay(waitScroll); }  // Green
void ledStripBlue()   { led.setColor(  0,   0, 255); home_page(); delay(waitScroll); }  // Blue
void ledStripWhite()  { led.setColor(255, 255, 255); home_page(); delay(waitScroll); }  // White
void ledStripBlank()  { led.setColor();              home_page(); delay(waitScroll); }  // Blank
#endif

void ampmOnOff() {  // AM-PM Mode, 24: 24-hour clock, 12: 12-hour clock
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  if (am_pm == 12) {
    printStringWithShift("AM-PM Mode Off", stringShiftDelay);
  } else {
    printStringWithShift("AM-PM Mode On", stringShiftDelay);
  }
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  if (am_pm == 12) {
    am_pm = 24;
    if (alarm_h_set > 12) {
      alarm_h_set = alarm_h_set - 12;
      alarm_ampm_select = "PM";
    } else {
      alarm_ampm_select = "AM";
    }
  } else {
    am_pm = 12;
    if (alarm_ampm_select == "PM") {
      if (alarm_h_set == 12) {
        alarm_h_set = alarm_h_set - 12;
      } else {
        alarm_h_set = alarm_h_set + 12;
      }
    }
  }
  ntpTime();
  home_page();
  delay(waitScroll);
}

void alarmTime() {
  String ampm_select;
  if (am_pm == 12) {
    ampm_select  = server.arg("ampm");
  }
  String alarm_h_time = server.arg("alarm_h_time");
  String alarm_m_time = server.arg("alarm_m_time");
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("The alarm is set to ", stringShiftDelay);
  if (am_pm == 12) {
    printStringWithShift(ampm_select.c_str(), stringShiftDelay);
    printStringWithShift(" ", stringShiftDelay);
  }
  printStringWithShift(alarm_h_time.c_str(), stringShiftDelay);
  printStringWithShift(":", stringShiftDelay);
  printStringWithShift(alarm_m_time.c_str(), stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  if (am_pm == 12) {
    alarm_ampm_select = ampm_select;
  }
  alarm_h_set = alarm_h_time.toInt();
  alarm_m_set = alarm_m_time.toInt();
  onTimeAlarm = 0;
  home_page();
  delay(waitScroll);
}

void onTimeALARM() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("On-time Alarm Setting", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  onTimeAlarm = 1;
  alarm_h_set = 00;
  alarm_m_set = 00;
  home_page();
  delay(waitScroll);
}

void alarmOnOff() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Alarm Setting", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  if (alarm_state == 0) {
    alarm_state = 1;
  } else {
    alarm_state = 0;
  }
  home_page();
  delay(waitScroll);
}

#ifdef USE_TIMER
void timerStart() {
  String ampm_select;
  if (am_pm == 12) {
    ampm_select  = server.arg("ampm");
  }
  String timer_h_time = server.arg("timer_h_time");
  String timer_m_time = server.arg("timer_m_time");
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("The timer is set to start ", stringShiftDelay);
  if (am_pm == 12) {
    printStringWithShift(ampm_select.c_str(), stringShiftDelay);
    printStringWithShift(" ", stringShiftDelay);
  }
  printStringWithShift(timer_h_time.c_str(), stringShiftDelay);
  printStringWithShift(":", stringShiftDelay);
  printStringWithShift(timer_m_time.c_str(), stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  if (am_pm == 12) {
    timer_start_ampm_select = ampm_select;
  }
  timer_h_start = timer_h_time.toInt();
  timer_m_start = timer_m_time.toInt();
  home_page();
  delay(waitScroll);
}
void timerStop() {
  String ampm_select;
  if (am_pm == 12) {
    ampm_select  = server.arg("ampm");
  }
  String timer_h_time = server.arg("timer_h_time");
  String timer_m_time = server.arg("timer_m_time");
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("The timer is set to stop ", stringShiftDelay);
  if (am_pm == 12) {
    printStringWithShift(ampm_select.c_str(), stringShiftDelay);
    printStringWithShift(" ", stringShiftDelay);
  }
  printStringWithShift(timer_h_time.c_str(), stringShiftDelay);
  printStringWithShift(":", stringShiftDelay);
  printStringWithShift(timer_m_time.c_str(), stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  if (am_pm == 12) {
    timer_stop_ampm_select = ampm_select;
  }
  timer_h_stop = timer_h_time.toInt();
  timer_m_stop = timer_m_time.toInt();
  home_page();
  delay(waitScroll);
}
void timerOn() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Timer On", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  //digitalWrite(WHITE_PIN, HIGH);
  timer_state = 1;
  home_page();
  delay(waitScroll);
}
void timerOff() {
#ifdef USE_LED_MATRIX
  printStringWithShift("                ", stringShiftDelay);
  printStringWithShift("Timer Off", stringShiftDelay);
  delay(waitScroll);
  printStringWithShift("                ", stringShiftDelay);
#endif
  //digitalWrite(WHITE_PIN, LOW);
  timer_state = 0;
  home_page();
  delay(waitScroll);
}
#endif

#ifdef USE_LED_MATRIX
void button00() { printStringWithShift("                ", stringShiftDelay); printStringWithShift("I love you",                        stringShiftDelay); home_page(); delay(waitScroll); }
void button01() { printStringWithShift("                ", stringShiftDelay); printStringWithShift("Don't get upset",                   stringShiftDelay); home_page(); delay(waitScroll); }
void button02() { printStringWithShift("                ", stringShiftDelay); printStringWithShift("I'm upset",                         stringShiftDelay); home_page(); delay(waitScroll); }
void button03() { printStringWithShift("                ", stringShiftDelay); printStringWithShift("Catch me if you can",               stringShiftDelay); home_page(); delay(waitScroll); }
void button04() { printStringWithShift("                ", stringShiftDelay); printStringWithShift("You will never know until you try", stringShiftDelay); home_page(); delay(waitScroll); }
void button05() { printStringWithShift("                ", stringShiftDelay); printStringWithShift("Pain past is pleasure",             stringShiftDelay); home_page(); delay(waitScroll); }
#endif

