ZalophusDokdo/LED_Matrix_Bar_Weather_Station/ESP8266/ESP8266_LED_Matrix_Bar_Weather_Station/Web_Server.h
// Web Server Start ========================================================
void Webserver_setup() {
  server.begin();
#ifdef USE_UART
  Serial.println("Server started");
  Serial.println();
  delay(10);
#endif

  server.on("/",                         home_page);

  server.on("/ClockOn",                   Clock_On);  // Define what happens when a client requests attention
  server.on("/ClockOff",                 Clock_Off);  // Define what happens when a client requests attention
  server.on("/showAnimClockOn",   showAnimClock_On);  // Define what happens when a client requests attention
  server.on("/showAnimClockOff", showAnimClock_Off);  // Define what happens when a client requests attention
  server.on("/dateScrollOn",         dateScroll_On);  // Define what happens when a client requests attention
  server.on("/dateScrollOff",       dateScroll_Off);  // Define what happens when a client requests attention
  server.on("/weatherScrollOn",   weatherScroll_On);  // Define what happens when a client requests attention
  server.on("/weatherScrollOff", weatherScroll_Off);  // Define what happens when a client requests attention
  server.on("/weatherSCROLL",        weatherSCROLL);  // Define what happens when a client requests attention
  server.on("/msg",                     handle_msg);  // And as regular external functions:
  server.on("/repeatprintMsg",      repeatprintMsg);  // And as regular external functions:
  server.on("/OTAmodeOn",                OTAmodeOn);  // And as regular external functions:
  server.on("/OTAmodeOff",              OTAmodeOff);  // And as regular external functions:
  server.on("/updateDATA",              updateDATA);  // And as regular external functions:
  server.on("/ESPrestart",              ESPrestart);  // And as regular external functions:
  server.on("/resetAP",                    resetAP);  // And as regular external functions:

  server.on("/ampmOnOff",                ampmOnOff);
  server.on("/alarmTime",                alarmTime);
  server.on("/onTimeALARM",            onTimeALARM);
  server.on("/alarmOnOff",              alarmOnOff);
  
  server.on("/inDoor",                      inDoor);
  server.on("/outDoor",                    outDoor);
  server.on("/inDoorScrollOn",      inDoorScrollOn);
  server.on("/inDoorScrollOff",    inDoorScrollOff);
  server.on("/outDoorScrollOn",    outDoorScrollOn);
  server.on("/outDoorScrollOff",  outDoorScrollOff);
#ifdef USE_TIMER
  server.on("/timerStart",              timerStart);
  server.on("/timerStop",                timerStop);
  server.on("/timerOn",                    timerOn);
  server.on("/timerOff",                  timerOff);
#endif
#if defined(DEV_BOARD_Witty) || defined(DEV_BOARD_WiFi_RELAY_MODULE)
  #ifdef USE_LIGHT
  server.on("/light05on",                light05on);
  server.on("/light05off",              light05off);
  #endif
#endif
  server.on("/alarm16on",                alarm16on);
  server.on("/alarm16off",              alarm16off);
  server.on("/lamp00on",                  lamp00on);
  server.on("/lamp00off",                lamp00off);
  server.on("/scroll12on",              scroll12on);
  server.on("/scroll12off",            scroll12off);
#ifdef USE_LED_MATRIX
  server.on("/button00",                  button00);
  server.on("/button01",                  button01);
  server.on("/button02",                  button02);
  server.on("/button03",                  button03);
  server.on("/button04",                  button04);
  server.on("/button05",                  button05);
#endif
#ifdef USE_RGB_LED_NEOPIXEL
  server.on("/ledRed",                                 ledRed);
  server.on("/ledGreen",                             ledGreen);
  server.on("/ledBlue",                               ledBlue);
  server.on("/ledWhite",                             ledWhite);
  server.on("/ledBlank",                             ledBlank);
#endif
#ifdef USE_RGB_LED_DIRECT
  server.on("/ledDirectRed",          ledDirectRed);
  server.on("/ledDirectGreen",      ledDirectGreen);
  server.on("/ledDirectBlue",        ledDirectBlue);
  server.on("/ledDirectWhite",      ledDirectWhite);
  server.on("/ledDirectBlank",      ledDirectBlank);
#endif
#ifdef USE_RGB_LED_STRIP_DRIVER
  server.on("/ledStripRed",            ledStripRed);
  server.on("/ledStripGreen",        ledStripGreen);
  server.on("/ledStripBlue",          ledStripBlue);
  server.on("/ledStripWhite",        ledStripWhite);
  server.on("/ledStripBlank",        ledStripBlank);
#endif
}

void Webserver_action() {
  update_webpage();
  server.handleClient();  // Wait for a client to connect and when they do process their requests
}

#endif
